Revit 2027 API
ParameterTypeId.AnalyticalModelFloorAlignmentMethod Property
 "Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelFloorAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelFloorAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelFloorAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelFloorAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace